import pandas as pd
import pytest


@pytest.fixture
def df_excel_test():
    df_excel = pd.DataFrame(
        {
            "Номер карты": ["*1111", "*2222", "*1111", "*3333", "*3333"],
            "Статус": ["OK", "OK", "FAILED", "OK", "OK"],
            "Валюта операции": ["RUB", "RUB", "RUB", "RUB", "EUR"],
            "Сумма операции": [-1000, -500, -2000, -100, -3000],
            "Кэшбэк": [10, 5, 0, 0, 0],
        }
    )
    return df_excel


@pytest.fixture
def df_excel_test_invalid():
    df_excel = pd.DataFrame(
        {
            "Номер карты": ["*1111", "*2222", "*1111", "*3333", "*3333"],
            "Статус": ["OK", "OK", "OK", "OK", "OK"],
            "Валюта операции": ["RUB", "RUB", "RUB", "RUB", "EUR"],
            "Сумма операции": ["1000", 500, 2000, 100, 3000],
            "Кэшбэк": [10, 5, 0, 0, 0],
        }
    )
    return df_excel


@pytest.fixture
def df_excel_top_5_test():
    df_excel = pd.DataFrame(
        {
            "Дата операции": [
                "31.12.2021 16:42:04",
                "30.12.2021 22:22:03",
                "29.12.2021 22:22:03",
                "28.12.2021 22:22:03",
                "27.12.2021 22:22:03",
                "26.12.2021 22:22:03",
                "25.12.2021 22:22:03",
            ],
            "Статус": ["OK", "OK", "FAILED", "OK", "OK", "OK", "OK"],
            "Валюта операции": ["RUB", "RUB", "RUB", "RUB", "EUR", "RUB", "RUB"],
            "Сумма операции": [1000, 500, 2000, 100, 3000, 1, 0],
            "Категория": ["Перевод", "Вклад", "Оплата ЖКХ", "Налоги", "Перевод", "Перевод", "Оплата"],
            "Описание": ["Перевод", "Вклад", "Оплата ЖКХ", "Налоги", "Перевод", "Перевод", "Оплата"],
        }
    )
    return df_excel


@pytest.fixture
def df_excel_top_5_invalid():
    df_excel = pd.DataFrame(
        {
            "Дата операции": [
                "31.12.2021 16:42:04",
                "30.12.2021 22:22:03",
                "29.12.2021 22:22:03",
                "28.12.2021 22:22:03",
                "27.12.2021 22:22:03",
                "26.12.2021 22:22:03",
                "25.12.2021 22:22:03",
            ],
            "Статус": ["OK", "OK", "FAILED", "OK", "OK", "OK", "OK"],
            "Валюта операции": ["RUB", "RUB", "RUB", "RUB", "EUR", "RUB", "RUB"],
            "Сумма операции": ["1000", 500, 2000, 100, 3000, 1, 0],
            "Категория": ["Перевод", "Вклад", "Оплата ЖКХ", "Налоги", "Перевод", "Перевод", "Оплата"],
            "Описание": ["Перевод", "Вклад", "Оплата ЖКХ", "Налоги", "Перевод", "Перевод", "Оплата"],
        }
    )
    return df_excel


@pytest.fixture
def main_page_dict():
    return {
        "greeting": "Доброе утро",
        "cards": [
            {"last_digits": "1111", "total_spent": 1000, "cashback": 10},
            {"last_digits": "2222", "total_spent": 500, "cashback": 5},
            {"last_digits": "3333", "total_spent": 100, "cashback": 0},
        ],
        "top_transactions": [
            {"date": "31.12.2021", "amount": 1000, "category": "Перевод", "description": "Перевод"},
            {"date": "30.12.2021", "amount": 500, "category": "Вклад", "description": "Вклад"},
            {"date": "28.12.2021", "amount": 100, "category": "Налоги", "description": "Налоги"},
            {"date": "26.12.2021", "amount": 1, "category": "Перевод", "description": "Перевод"},
            {"date": "25.12.2021", "amount": 0, "category": "Оплата", "description": "Оплата"},
        ],
        "currency_rates": [{"currency": "USD", "rate": 106.46}, {"currency": "EUR", "rate": 112.63}],
        "stock_prices": [
            {"stock": "AAPL", "price": 500},
            {"stock": "GOOGL", "price": 400},
            {"stock": "TSLA", "price": 200},
        ],
    }


@pytest.fixture
def transactions_for_investment_bank():
    return [
        {"Дата операции": "2018-01-15", "Сумма операции": -7196.8},
        {"Дата операции": "2018-01-15", "Сумма операции": -209.0},
        {"Дата операции": "2018-01-14", "Сумма операции": -69.0},
        {"Дата операции": "2018-01-14", "Сумма операции": -69.0},
        {"Дата операции": "2018-01-14", "Сумма операции": -104.0},
        {"Дата операции": "2018-01-11", "Сумма операции": -94.0},
        {"Дата операции": "2018-01-10", "Сумма операции": -1041.74},
        {"Дата операции": "2018-01-10", "Сумма операции": -634.0},
        {"Дата операции": "2018-01-08", "Сумма операции": -364.49},
        {"Дата операции": "2018-01-08", "Сумма операции": -250.0},
        {"Дата операции": "2018-01-08", "Сумма операции": -1004.9},
        {"Дата операции": "2018-01-05", "Сумма операции": -79.6},
        {"Дата операции": "2018-01-05", "Сумма операции": -120.0},
        {"Дата операции": "2018-01-04", "Сумма операции": -1025.0},
        {"Дата операции": "2018-01-04", "Сумма операции": -1065.9},
        {"Дата операции": "2018-01-03", "Сумма операции": -73.06},
        {"Дата операции": "2018-01-03", "Сумма операции": -21.0},
        {"Дата операции": "2018-01-01", "Сумма операции": -316.0},
        {"Дата операции": "2018-01-01", "Сумма операции": -3000.0},
    ]


@pytest.fixture
def df_excel_for_investment():
    df_excel = pd.DataFrame(
        {
            "Дата операции": [
                "31.12.2021 16:42:04",
                "30.12.2021 22:22:03",
                "29.12.2021 22:22:03",
                "28.12.2021 22:22:03",
                "27.12.2021 22:22:03",
                "26.12.2021 22:22:03",
                "25.12.2021 22:22:03",
            ],
            "Статус": ["OK", "OK", "FAILED", "OK", "OK", "OK", "OK"],
            "Валюта операции": ["RUB", "RUB", "RUB", "RUB", "EUR", "RUB", "RUB"],
            "Сумма операции": [-1000, -500, -2000, -100, -3000, -10, -50],
            "Категория": ["Перевод", "Вклад", "Оплата ЖКХ", "Налоги", "Перевод", "Перевод", "Оплата"],
            "Описание": ["Перевод", "Вклад", "Оплата ЖКХ", "Налоги", "Перевод", "Перевод", "Оплата"],
        }
    )
    return df_excel


@pytest.fixture
def df_excel_for_report():
    df_excel_for_report = pd.DataFrame(
        {
            "Дата платежа": [
                "31.12.2021",
                "30.12.2021",
                "29.11.2021",
                "28.11.2021",
                "27.10.2021",
                "26.10.2021",
                "25.09.2021",
            ],
            "Статус": ["OK", "OK", "OK", "OK", "OK", "OK", "OK"],
            "Валюта операции": ["RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB"],
            "Сумма операции": [-1000, -500, -2000, -100, -3000, -10, -50],
            "Категория": ["Перевод", "Вклад", "Оплата ЖКХ", "Налоги", "Перевод", "Перевод", "Перевод"],
            "Описание": ["Перевод", "Вклад", "Оплата ЖКХ", "Налоги", "Перевод", "Перевод", "Перевод"],
        }
    )
    return df_excel_for_report.reset_index(drop=True)


@pytest.fixture
def df_excel_for_report_expected():
    df_excel_for_report_expected = pd.DataFrame(
        {
            "Дата платежа": pd.to_datetime(["31.12.2021", "27.10.2021", "26.10.2021"], format="%d.%m.%Y"),
            "Статус": ["OK", "OK", "OK"],
            "Валюта операции": ["RUB", "RUB", "RUB"],
            "Сумма операции": [-1000, -3000, -10],
            "Категория": ["Перевод", "Перевод", "Перевод"],
            "Описание": ["Перевод", "Перевод", "Перевод"],
        }
    )
    return df_excel_for_report_expected.reset_index(drop=True)


@pytest.fixture
def df_excel_no_columns():
    df_excel_no_columns = pd.DataFrame(
        {
            "Дата платежа": pd.to_datetime(["31.12.2021", "27.10.2021", "26.10.2021"], format="%d.%m.%Y"),
            "Статус": ["OK", "OK", "OK"],
            "Валюта операции": ["RUB", "RUB", "RUB"],
            "Описание": ["Перевод", "Перевод", "Перевод"],
        }
    )
    return df_excel_no_columns


@pytest.fixture
def df_excel_invalid_sum():
    df_excel_invalid_sum = pd.DataFrame(
        {
            "Дата платежа": pd.to_datetime(["31.12.2021", "27.10.2021", "26.10.2021"], format="%d.%m.%Y"),
            "Статус": ["OK", "OK", "OK"],
            "Валюта операции": ["RUB", "RUB", "RUB"],
            "Сумма операции": ["-1000", "-3000", "-10"],
            "Категория": ["Перевод", "Перевод", "Перевод"],
            "Описание": ["Перевод", "Перевод", "Перевод"],
        }
    )
    return df_excel_invalid_sum
